app/src/Templates/advancecare/pharma_act.xml.j2

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{ username }}</wsse:Username>
        <wsse:Password>{{ password }}</wsse:Password>
        <wsse:Created>{{ created }}</wsse:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <ns2:performPharmaActRequest xmlns:ns2="http://pt.advancecare.awsp.eligibilityAO">
      <PharmaActParametersTO_1>
        <buID>{{ data.buID }}</buID>
        <currencyCode>{{ data.currencyCode }}</currencyCode>
        <dos>{{ data.dos }}</dos>
{% for pharmaService in data.pharmaServiceValuesList %}
        <pharmaServiceValues>
          <amtClaimed>{{ pharmaService.amtClaimed }}</amtClaimed>
          <procCode>{{ pharmaService.procCode }}</procCode>
          <iva>{{ pharmaService.iva }}</iva>
          <unit>{{ pharmaService.unit }}</unit>
        </pharmaServiceValues>
{% endfor %}
        <memID>{{ data.memID }}</memID>
        <practiceSeq>{{ data.practiceSeq }}</practiceSeq>
        <providerID>{{ data.providerID }}</providerID>
{% if data.get('memPhone') %}
        <memPhone>{{ data.memPhone }}</memPhone>
{% else %}
        <memPhone xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
{% endif %}
{% if data.get('memEmail') %}
        <memEmail>{{ data.memEmail }}</memEmail>
{% else %}
        <memEmail xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
{% endif %}
      </PharmaActParametersTO_1>
    </ns2:performPharmaActRequest>
  </soap:Body>
</soap:Envelope>